OpenFOAM-13/tutorials/XiFluid/1D/constant/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heheuPsiThermo;
    mixture         homogeneousMixture;
    transport       const;
    thermo          hConst;
    equationOfState perfectGas;
    specie          specie;
    energy          absoluteEnthalpy;
}

stoichiometricAirFuelMassRatio 15.675;

reactants
{
    specie
    {
        molWeight       29.4649;
    }
    thermodynamics
    {
        Cp              1000;
        hf              1700e3;
    }
    transport
    {
        mu              1e-5;
        Pr              1;
    }
}

products
{
    specie
    {
        molWeight       28.3233;
    }
    thermodynamics
    {
        Cp              1000;
        hf              0;
    }
    transport
    {
        mu              1e-5;
        Pr              1;
    }
}

// ************************************************************************* //
